betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_sram.c
    /* Update the SRAM controller state */
    hsram->State = state;

    /* Process unlocked */
    __DAL_UNLOCK(hsram);
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Writes 32-bit buffer to SRAM memory.
  * @param  hsram pointer to a SRAM_HandleTypeDef structure that contains
  *                the configuration information for SRAM module.
  * @param  pAddress Pointer to write start address
  * @param  pSrcBuffer Pointer to source buffer to write
  * @param  BufferSize Size of the buffer to write to memory
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SRAM_Write_32b(SRAM_HandleTypeDef *hsram, uint32_t *pAddress, uint32_t *pSrcBuffer,
                                     uint32_t BufferSize)
{
  uint32_t size;
  __IO uint32_t *psramaddress = pAddress;
  uint32_t *psrcbuff = pSrcBuffer;

  /* Check the SRAM controller state */
  if (hsram->State == DAL_SRAM_STATE_READY)
  {
    /* Process Locked */
    __DAL_LOCK(hsram);

    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_BUSY;

    /* Write data to memory */
    for (size = BufferSize; size != 0U; size--)
    {
      *psramaddress = *psrcbuff;
      psrcbuff++;
      psramaddress++;
    }

    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_READY;

    /* Process unlocked */
    __DAL_UNLOCK(hsram);
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Reads a Words data from the SRAM memory using DMA transfer.
  * @param  hsram pointer to a SRAM_HandleTypeDef structure that contains
  *                the configuration information for SRAM module.
  * @param  pAddress Pointer to read start address
  * @param  pDstBuffer Pointer to destination buffer
  * @param  BufferSize Size of the buffer to read from memory
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SRAM_Read_DMA(SRAM_HandleTypeDef *hsram, uint32_t *pAddress, uint32_t *pDstBuffer,
                                    uint32_t BufferSize)
{
  DAL_StatusTypeDef status;
  DAL_SRAM_StateTypeDef state = hsram->State;

  /* Check the SRAM controller state */
  if ((state == DAL_SRAM_STATE_READY) || (state == DAL_SRAM_STATE_PROTECTED))
  {
    /* Process Locked */
    __DAL_LOCK(hsram);

    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_BUSY;

    /* Configure DMA user callbacks */
    if (state == DAL_SRAM_STATE_READY)
    {
      hsram->hdma->XferCpltCallback = SRAM_DMACplt;
    }
    else
    {
      hsram->hdma->XferCpltCallback = SRAM_DMACpltProt;
    }
    hsram->hdma->XferErrorCallback = SRAM_DMAError;

    /* Enable the DMA Stream */
    status = DAL_DMA_Start_IT(hsram->hdma, (uint32_t)pAddress, (uint32_t)pDstBuffer, (uint32_t)BufferSize);

    /* Process unlocked */
    __DAL_UNLOCK(hsram);
  }
  else
  {
    status = DAL_ERROR;
  }

  return status;
}

/**
  * @brief  Writes a Words data buffer to SRAM memory using DMA transfer.
  * @param  hsram pointer to a SRAM_HandleTypeDef structure that contains
  *                the configuration information for SRAM module.
  * @param  pAddress Pointer to write start address
  * @param  pSrcBuffer Pointer to source buffer to write
  * @param  BufferSize Size of the buffer to write to memory
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SRAM_Write_DMA(SRAM_HandleTypeDef *hsram, uint32_t *pAddress, uint32_t *pSrcBuffer,
                                     uint32_t BufferSize)
{
  DAL_StatusTypeDef status;

  /* Check the SRAM controller state */
  if (hsram->State == DAL_SRAM_STATE_READY)
  {
    /* Process Locked */
    __DAL_LOCK(hsram);

    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_BUSY;

    /* Configure DMA user callbacks */
    hsram->hdma->XferCpltCallback = SRAM_DMACplt;
    hsram->hdma->XferErrorCallback = SRAM_DMAError;

    /* Enable the DMA Stream */
    status = DAL_DMA_Start_IT(hsram->hdma, (uint32_t)pSrcBuffer, (uint32_t)pAddress, (uint32_t)BufferSize);

    /* Process unlocked */
    __DAL_UNLOCK(hsram);
  }
  else
  {
    status = DAL_ERROR;
  }

  return status;
}

#if (USE_DAL_SRAM_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User SRAM Callback
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hsram : SRAM handle
  * @param CallbackId : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SRAM_MSP_INIT_CB_ID       SRAM MspInit callback ID
  *          @arg @ref DAL_SRAM_MSP_DEINIT_CB_ID     SRAM MspDeInit callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
DAL_StatusTypeDef DAL_SRAM_RegisterCallback(SRAM_HandleTypeDef *hsram, DAL_SRAM_CallbackIDTypeDef CallbackId,
                                            pSRAM_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;
  DAL_SRAM_StateTypeDef state;

  if (pCallback == NULL)
  {
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hsram);

  state = hsram->State;
  if ((state == DAL_SRAM_STATE_READY) || (state == DAL_SRAM_STATE_RESET) || (state == DAL_SRAM_STATE_PROTECTED))
  {
    switch (CallbackId)
    {
      case DAL_SRAM_MSP_INIT_CB_ID :
        hsram->MspInitCallback = pCallback;
        break;
      case DAL_SRAM_MSP_DEINIT_CB_ID :
        hsram->MspDeInitCallback = pCallback;
        break;
      default :
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsram);
  return status;
}

/**
  * @brief  Unregister a User SRAM Callback
  *         SRAM Callback is redirected to the weak (surcharged) predefined callback
  * @param hsram : SRAM handle
  * @param CallbackId : ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SRAM_MSP_INIT_CB_ID       SRAM MspInit callback ID
  *          @arg @ref DAL_SRAM_MSP_DEINIT_CB_ID     SRAM MspDeInit callback ID
  *          @arg @ref DAL_SRAM_DMA_XFER_CPLT_CB_ID  SRAM DMA Xfer Complete callback ID
  *          @arg @ref DAL_SRAM_DMA_XFER_ERR_CB_ID   SRAM DMA Xfer Error callback ID
  * @retval status
  */
DAL_StatusTypeDef DAL_SRAM_UnRegisterCallback(SRAM_HandleTypeDef *hsram, DAL_SRAM_CallbackIDTypeDef CallbackId)
{
  DAL_StatusTypeDef status = DAL_OK;
  DAL_SRAM_StateTypeDef state;

  /* Process locked */
  __DAL_LOCK(hsram);

  state = hsram->State;
  if ((state == DAL_SRAM_STATE_READY) || (state == DAL_SRAM_STATE_PROTECTED))
  {
    switch (CallbackId)
    {
      case DAL_SRAM_MSP_INIT_CB_ID :
        hsram->MspInitCallback = DAL_SRAM_MspInit;
        break;
      case DAL_SRAM_MSP_DEINIT_CB_ID :
        hsram->MspDeInitCallback = DAL_SRAM_MspDeInit;
        break;
      case DAL_SRAM_DMA_XFER_CPLT_CB_ID :
        hsram->DmaXferCpltCallback = DAL_SRAM_DMA_XferCpltCallback;
        break;
      case DAL_SRAM_DMA_XFER_ERR_CB_ID :
        hsram->DmaXferErrorCallback = DAL_SRAM_DMA_XferErrorCallback;
        break;
      default :
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (state == DAL_SRAM_STATE_RESET)
  {
    switch (CallbackId)
    {
      case DAL_SRAM_MSP_INIT_CB_ID :
        hsram->MspInitCallback = DAL_SRAM_MspInit;
        break;
      case DAL_SRAM_MSP_DEINIT_CB_ID :
        hsram->MspDeInitCallback = DAL_SRAM_MspDeInit;
        break;
      default :
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsram);
  return status;
}

/**
  * @brief  Register a User SRAM Callback for DMA transfers
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hsram : SRAM handle
  * @param CallbackId : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_SRAM_DMA_XFER_CPLT_CB_ID  SRAM DMA Xfer Complete callback ID
  *          @arg @ref DAL_SRAM_DMA_XFER_ERR_CB_ID   SRAM DMA Xfer Error callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
DAL_StatusTypeDef DAL_SRAM_RegisterDmaCallback(SRAM_HandleTypeDef *hsram, DAL_SRAM_CallbackIDTypeDef CallbackId,
                                               pSRAM_DmaCallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;
  DAL_SRAM_StateTypeDef state;

  if (pCallback == NULL)
  {
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hsram);

  state = hsram->State;
  if ((state == DAL_SRAM_STATE_READY) || (state == DAL_SRAM_STATE_PROTECTED))
  {
    switch (CallbackId)
    {
      case DAL_SRAM_DMA_XFER_CPLT_CB_ID :
        hsram->DmaXferCpltCallback = pCallback;
        break;
      case DAL_SRAM_DMA_XFER_ERR_CB_ID :
        hsram->DmaXferErrorCallback = pCallback;
        break;
      default :
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hsram);
  return status;
}
#endif /* USE_DAL_SRAM_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup SRAM_Exported_Functions_Group3 Control functions
  *  @brief   Control functions
  *
@verbatim
  ==============================================================================
                        ##### SRAM Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control dynamically
    the SRAM interface.

@endverbatim
  * @{
  */

/**
  * @brief  Enables dynamically SRAM write operation.
  * @param  hsram pointer to a SRAM_HandleTypeDef structure that contains
  *                the configuration information for SRAM module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SRAM_WriteOperation_Enable(SRAM_HandleTypeDef *hsram)
{
  /* Check the SRAM controller state */
  if (hsram->State == DAL_SRAM_STATE_PROTECTED)
  {
    /* Process Locked */
    __DAL_LOCK(hsram);

