betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_sram.c
    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_BUSY;

    /* Enable write operation */
    (void)FMC_NORSRAM_WriteOperation_Enable(hsram->Instance, hsram->Init.NSBank);

    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_READY;

    /* Process unlocked */
    __DAL_UNLOCK(hsram);
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  Disables dynamically SRAM write operation.
  * @param  hsram pointer to a SRAM_HandleTypeDef structure that contains
  *                the configuration information for SRAM module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SRAM_WriteOperation_Disable(SRAM_HandleTypeDef *hsram)
{
  /* Check the SRAM controller state */
  if (hsram->State == DAL_SRAM_STATE_READY)
  {
    /* Process Locked */
    __DAL_LOCK(hsram);

    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_BUSY;

    /* Disable write operation */
    (void)FMC_NORSRAM_WriteOperation_Disable(hsram->Instance, hsram->Init.NSBank);

    /* Update the SRAM controller state */
    hsram->State = DAL_SRAM_STATE_PROTECTED;

    /* Process unlocked */
    __DAL_UNLOCK(hsram);
  }
  else
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup SRAM_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions
  *
@verbatim
  ==============================================================================
                      ##### SRAM State functions #####
  ==============================================================================
  [..]
    This subsection permits to get in run-time the status of the SRAM controller
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Returns the SRAM controller state
  * @param  hsram pointer to a SRAM_HandleTypeDef structure that contains
  *                the configuration information for SRAM module.
  * @retval DAL state
  */
DAL_SRAM_StateTypeDef DAL_SRAM_GetState(SRAM_HandleTypeDef *hsram)
{
  return hsram->State;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @brief  DMA SRAM process complete callback.
  * @param  hdma : DMA handle
  * @retval None
  */
static void SRAM_DMACplt(DMA_HandleTypeDef *hdma)
{
  SRAM_HandleTypeDef *hsram = (SRAM_HandleTypeDef *)(hdma->Parent);

  /* Disable the DMA channel */
  __DAL_DMA_DISABLE(hdma);

  /* Update the SRAM controller state */
  hsram->State = DAL_SRAM_STATE_READY;

#if (USE_DAL_SRAM_REGISTER_CALLBACKS == 1)
  hsram->DmaXferCpltCallback(hdma);
#else
  DAL_SRAM_DMA_XferCpltCallback(hdma);
#endif /* USE_DAL_SRAM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SRAM process complete callback.
  * @param  hdma : DMA handle
  * @retval None
  */
static void SRAM_DMACpltProt(DMA_HandleTypeDef *hdma)
{
  SRAM_HandleTypeDef *hsram = (SRAM_HandleTypeDef *)(hdma->Parent);

  /* Disable the DMA channel */
  __DAL_DMA_DISABLE(hdma);

  /* Update the SRAM controller state */
  hsram->State = DAL_SRAM_STATE_PROTECTED;

#if (USE_DAL_SRAM_REGISTER_CALLBACKS == 1)
  hsram->DmaXferCpltCallback(hdma);
#else
  DAL_SRAM_DMA_XferCpltCallback(hdma);
#endif /* USE_DAL_SRAM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SRAM error callback.
  * @param  hdma : DMA handle
  * @retval None
  */
static void SRAM_DMAError(DMA_HandleTypeDef *hdma)
{
  SRAM_HandleTypeDef *hsram = (SRAM_HandleTypeDef *)(hdma->Parent);

  /* Disable the DMA channel */
  __DAL_DMA_DISABLE(hdma);

  /* Update the SRAM controller state */
  hsram->State = DAL_SRAM_STATE_ERROR;

#if (USE_DAL_SRAM_REGISTER_CALLBACKS == 1)
  hsram->DmaXferErrorCallback(hdma);
#else
  DAL_SRAM_DMA_XferErrorCallback(hdma);
#endif /* USE_DAL_SRAM_REGISTER_CALLBACKS */
}

/**
  * @}
  */

#endif /* DAL_SRAM_MODULE_ENABLED */

/**
  * @}
  */

#endif /* SMC_Bank1 */
